# Pandas

In [22]:
import numpy as np
import pandas as pd

# Creating Series
There are serveral ways ti creating a Series:
* list
* Dictionary
* Numpy Array

# Creating a Series frompython list

In [24]:
data = [1,2,3,4,5,6]
type(data)

list

In [47]:
# creating a Series from list
sr = pd.Series(data)
# type of df
type(sr)

pandas.core.series.Series

In [46]:
sr

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

# Creating a Series from python dictionary

In [30]:
data_dic ={
    "name": "radhe",
    "address": "thimi",
    "age": 12
}

In [31]:
df = pd.Series(data_dic)

In [32]:
df

name       radhe
address    thimi
age           12
dtype: object

In [33]:
type(df)

pandas.core.series.Series

# Creating a Series from numpy array

In [40]:
arra = np.array(data)
type(arra)

numpy.ndarray

In [43]:
sr = pd.Series(arra)
print(df)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [44]:
type(sr)

pandas.core.series.Series

In [42]:
df.shape

(6,)

# Creating DataFram
Serveral ways to create Pandas DataFrame are:
* Create DataFrame from 2D list
* Create DataFrame from Dictionary of lists
* Create DataFrame from list of dictionary
* Create DataFrame from csv file
* Create DataFrame from excel file

# Create DataFrame from 2D list

In [62]:
data = [[1,2],[3,4,],[5,6,]]
print(len(data))

3

In [60]:
df = pd.DataFrame(data, columns=['col1','col2'])

In [61]:
df

   col1  col2
0     1     2
1     3     4
2     5     6

# Create DataFrame from Dictionary of lists

In [64]:
data ={
    "name": ["ram", "hari","sita"],
    "address": ["ktm","ktm","bkt"]
}

In [67]:
df_dic = pd.DataFrame(data)
df_dic

   name address
0   ram     ktm
1  hari     ktm
2  sita     bkt

In [80]:
df_dic.rename({"name":"f_name"}, axis="columns")

  f_name address
0    ram     ktm
1   hari     ktm
2   sita     bkt

# Create DataFrame from list of dictionary

In [82]:
data = [
    {
        "name": "ram",
        "age": 12
        
    },
    {
        "address": "bkt",
        "gender": 'Male'
    }
]

In [74]:
type(data)

list

In [75]:
for i in data:
    print(type(i))

<class 'dict'>
<class 'dict'>

In [78]:
df = pd.DataFrame(data)
df

  name   age address gender
0  ram  12.0     NaN    NaN
1  NaN   NaN     bkt   Male

# Data Ingestion:
* Data ingestion is the process of obtaining and inport data for immediate use of storage in a database.
* This repository includes variaty of Dataset, so for now we will use that as data source.

# Create DataFrame from csv file

In [90]:
df = pd.read_csv("car_details.csv")

In [91]:
df

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner
...,...,...,...,...,...,...,...,...
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual,Second Owner
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual,Second Owner
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner

In [115]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ------------------------------------ 250.0/250.0 kB 959.0 kB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

[notice] A new release of pip available: 22.3.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [116]:
import openpyxl

ModuleNotFoundError: No module named 'openpyxl'

# Viewing Data

In [108]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [110]:
df.describe()

              year  selling_price      km_driven
count  4340.000000   4.340000e+03    4340.000000
mean   2013.090783   5.041273e+05   66215.777419
std       4.215344   5.785487e+05   46644.102194
min    1992.000000   2.000000e+04       1.000000
25%    2011.000000   2.087498e+05   35000.000000
50%    2014.000000   3.500000e+05   60000.000000
75%    2016.000000   6.000000e+05   90000.000000
max    2020.000000   8.900000e+06  806599.000000